Ran Plan for dir: `.` workspace: `production`

<details><summary>Show Output</summary>

```diff
module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "do_not_use_in_code" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-AmDqXqEHoQqJQv7A/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Resource targeting is in effect
│
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.kubernetes.module.postgresql.kubernetes_config_map.sql_scripts will be updated in-place
~ resource "kubernetes_config_map" "sql_scripts" {
      ~ data        = {
          ~ "thirtyinches_schema.sql" = <<-EOT
                -- Users table
                CREATE TABLE IF NOT EXISTS Users (
                    user_id SERIAL PRIMARY KEY,
                    email VARCHAR(255) NOT NULL UNIQUE,
                    first_name VARCHAR(255) NOT NULL,
                    last_name VARCHAR(255) NOT NULL,
                    created_at TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP
                );
                
              - -- -- Plans table
              - -- CREATE TABLE IF NOT EXISTS Plans (
              - --     plan_id SERIAL PRIMARY KEY,
              - --     name VARCHAR(255) NOT NULL,
              - --     description TEXT NOT NULL,
              - --     price DECIMAL(10, 2) NOT NULL,
              - --     period_type ENUM('MONTHLY', 'YEARLY') NOT NULL,
              - --     trial_days INTEGER DEFAULT NULL
              - -- );
              + -- Plans table
              + CREATE TABLE IF NOT EXISTS Plans (
              +     plan_id SERIAL PRIMARY KEY,
              +     name VARCHAR(255) NOT NULL,
              +     description TEXT NOT NULL,
              +     price DECIMAL(10, 2) NOT NULL,
              +     period_type ENUM('MONTHLY', 'YEARLY') NOT NULL,
              +     trial_days INTEGER DEFAULT NULL
              + );
                
                -- -- Subscriptions table
                -- CREATE TABLE IF NOT EXISTS Subscriptions (
                --     subscription_id SERIAL PRIMARY KEY,
                --     user_id INTEGER NOT NULL,
                --     plan_id INTEGER NOT NULL,
                --     start_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     end_date TIMESTAMP WITHOUT TIME ZONE DEFAULT NULL,
                --     status ENUM('active', 'cancelled', 'expired') NOT NULL DEFAULT 'active',
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     FOREIGN KEY (user_id) REFERENCES Users(user_id) ON DELETE CASCADE,
                --     FOREIGN KEY (plan_id) REFERENCES Plans(plan_id) ON DELETE RESTRICT
                -- );
                
                -- -- Transactions table
                -- CREATE TABLE IF NOT EXISTS Transactions (
                --     transaction_id SERIAL PRIMARY KEY,
                --     subscription_id INTEGER NOT NULL,
                --     amount DECIMAL(10, 2) NOT NULL,
                --     payment_date TIMESTAMP WITHOUT TIME ZONE NOT NULL DEFAULT CURRENT_TIMESTAMP,
                --     payment_method VARCHAR(255) DEFAULT NULL,
                --     status ENUM('successful', 'failed', 'pending') NOT NULL DEFAULT 'pending',
                --     FOREIGN KEY (subscription_id) REFERENCES Subscriptions(subscription_id) ON DELETE CASCADE
                -- );
                
                -- -- Add any additional tables or constraints as needed
                -- -- Example of adding an index on email for faster lookup
                -- CREATE INDEX idx_users_email ON Users(email);
            EOT
        }
        id          = "postgresql/sql-scripts"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kubernetes.module.postgresql.kubernetes_job.run_sql_scripts must be replaced
-/+ resource "kubernetes_job" "run_sql_scripts" {
      ~ id                  = "postgresql/run-sql-scripts" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
          ~ labels           = {} -> (known after apply)
            name             = "run-sql-scripts"
          ~ resource_version = "17762802" -> (known after apply)
          ~ uid              = "95bbddbc-3faa-4bb1-be4b-433508e1d2f2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
          - active_deadline_seconds = 0 -> null
          ~ completion_mode         = "NonIndexed" -> (known after apply)
          - manual_selector         = false -> null
            # (3 unchanged attributes hidden)

          - selector {
              - match_labels = {
                  - "batch.kubernetes.io/controller-uid" = "95bbddbc-3faa-4bb1-be4b-433508e1d2f2"
                } -> null
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  - labels           = {} -> null
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (9 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "postgres-client"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (6 unchanged attributes hidden)

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (3 unchanged blocks hidden)
                    }

                  ~ volume {
                        name = "sql-scripts-volume"

                      ~ config_map {
                            name         = "sql-scripts"
                          - optional     = false -> null
                            # (1 unchanged attribute hidden)
                        }
                    }
                }
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -w production`
* :put_litter_in_its_place: To **delete** this plan click [here](http://144.24.128.160:4141/lock?id=1995navinkumar%252Fterraform%252F.%252Fproduction)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -w production -- -target=module.kubernetes.module.postgresql`
</details>
Plan: 1 to add, 1 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`